# 4. Creating Pandas Series

In [3]:
import pandas as pd

In [4]:
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])

In [5]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [6]:
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements

In [7]:
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [8]:
x = 'bananas' in groceries
y = 'bread' in groceries
print('Is banana an index label in Groceries:', x)
print('Is bread an index label in Groceries:', y)

Is banana an index label in Groceries: False
Is bread an index label in Groceries: True

# 5. Accessing and Deleting Elements in Pandas Series

In [9]:
groceries['eggs']

30

In [10]:
groceries[['milk', 'bread']]

milk     Yes
bread     No
dtype: object

In [11]:
groceries[0]

30

In [12]:
groceries[-1]

'No'

In [13]:
groceries[[0, 1]]

eggs      30
apples     6
dtype: object

In [14]:
groceries.loc[['eggs', 'apples']]

eggs      30
apples     6
dtype: object

In [15]:
groceries.iloc[[2, 3]]

milk     Yes
bread     No
dtype: object

In [16]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [17]:
groceries['eggs'] = 2

In [18]:
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [19]:
groceries.drop('apples')

eggs       2
milk     Yes
bread     No
dtype: object

In [20]:
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [21]:
groceries.drop('apples', inplace = True)

In [22]:
groceries

eggs       2
milk     Yes
bread     No
dtype: object

In [23]:
print('How many eggs do we need to buy:', groceries['eggs'])

How many eggs do we need to buy: 2

In [24]:
print('Do we need milk and bread:\n', groceries[['milk', 'bread']])

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

In [25]:
groceries['apples'] = 6

In [26]:
print('How many eggs and apples do we need to buy:\n', groceries.loc[['eggs', 'apples']])

How many eggs and apples do we need to buy:
 eggs      2
apples    6
dtype: object

In [27]:
print('How many eggs and apples do we need to buy:\n',  groceries[[0, 3]])

How many eggs and apples do we need to buy:
 eggs      2
apples    6
dtype: object

In [28]:
print('Do we need bread:\n', groceries[[2]])

Do we need bread:
 bread    No
dtype: object

In [29]:
groceries.drop('apples', inplace = True)
groceries

eggs       2
milk     Yes
bread     No
dtype: object

# 6. Arithmetic Operations on Pandas Series

In [30]:
fruits = pd.Series(data = [10, 6, 3], index = ['apples', 'oranges', 'bananas'])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [31]:
print('Original grocery list of fruits:\n', fruits)

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

In [32]:
print('fruits + 2:\n', fruits + 2)

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64

In [33]:
print('fruits - 2:\n', fruits - 2)

fruits - 2:
 apples     8
oranges    4
bananas    1
dtype: int64

In [34]:
print('fruits * 2:\n', fruits * 2)

fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64

In [35]:
print('fruits / 2:\n', fruits / 2)

fruits / 2:
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [36]:
import numpy as np
print('Original grocery list of fruits:\n', fruits)

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

In [37]:
print('EXP(X) = \n', np.exp(fruits))

EXP(X) =
 apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [38]:
print('SQRT(X) = \n', np.sqrt(fruits))

SQRT(X) =
 apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [39]:
print('POW(X,2) = \n', np.power(fruits, 2))

POW(X,2) =
 apples     100
oranges     36
bananas      9
dtype: int64

In [40]:
print('Original grocery list of fruits:\n', fruits)

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

In [41]:
print('Amount of bananas + 2 =', fruits['bananas'] + 2)

Amount of bananas + 2 = 5

In [42]:
print('Amount of apples - 2 =', fruits['apples'] - 2)

Amount of apples - 2 = 8

In [43]:
print('We double the amount of apples and oranges:\n', fruits[['apples', 'oranges']] * 2)

We double the amount of apples and oranges:
 apples     20
oranges    12
dtype: int64

In [44]:
print('We half the amount of apples and oranges:\n', fruits.loc[['apples', 'oranges']] / 2)

We half the amount of apples and oranges:
 apples     5.0
oranges    3.0
dtype: float64

In [45]:
groceries * 2

eggs          4
milk     YesYes
bread      NoNo
dtype: object

# 7. Quiz: Manipulate a Series

In [46]:
import pandas as pd

# Create a Pandas Series that contains the distance of some planets from the Sun.
# Use the name of the planets as the index to your Pandas Series, and the distance
# from the Sun as your data. The distance from the Sun is in units of 10^6 km

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

# Create a Pandas Series using the above data, with the name of the planets as
# the index and the distance from the Sun as your data.
dist_planets = pd.Series(data = distance_from_sun, index = planets)

# Calculate the number of minutes it takes sunlight to reach each planet. You can
# do this by dividing the distance from the Sun for each planet by the speed of light.
# Since in the data above the distance from the Sun is in units of 10^6 km, you can
# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets / 18

In [47]:
dist_planets

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

In [48]:
time_light

Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64

In [49]:
# Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
close_planets = time_light[time_light < 40]
close_planets

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

# 8. Creating Pandas DataFrames

In [50]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

In [51]:
print(type(items))

<class 'dict'>

In [52]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [53]:
data = {'Bob' : pd.Series(data = [245, 25, 55]),
         'Alice' : pd.Series(data = [40, 110, 500, 45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [54]:
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The data in shopping_carts is:\n', shopping_carts.values)
print()
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The data in shopping_carts is:
 [[ 245.  500.]
 [  nan   40.]
 [  nan  110.]
 [  25.   45.]
 [  55.   nan]]

The row index in shopping_carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Bob', 'Alice'], dtype='object')

In [55]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [56]:
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [57]:
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [58]:
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}
df = pd.DataFrame(data)
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [59]:
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [60]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]
store_items = pd.DataFrame(items2)
store_items

   bikes  glasses  pants  watches
0     20      NaN     30       35
1     15     50.0      5       10

In [61]:
# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

# We display the DataFrame
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

# 9. Accessing Elements in Pandas DataFrames

In [62]:
print(store_items)

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [63]:
print('How many bikes are in each store:\n', store_items[['bikes']])

How many bikes are in each store:
          bikes
store 1     20
store 2     15

In [64]:
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

In [65]:
print('What items are in Store 1:\n', store_items.loc[['store 1']])

What items are in Store 1:
          bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [66]:
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])

How many bikes are in Store 2: 15

In [67]:
store_items['shirts'] = [15,2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [68]:
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [69]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index = ['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [70]:
store_items = store_items.append(new_store)
store_items

D:\Anaconda3\lib\site-packages\pandas\core\frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

In [71]:
store_items['new watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [72]:
store_items.insert(4, 'shoes', [8,5,0])

In [73]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store 1     20      NaN     30    15.0      8   45.0       35          NaN
store 2     15     50.0      5     2.0      5    7.0       10         10.0
store 3     20      4.0     30     NaN      0    NaN       35         35.0

In [74]:
store_items.pop('new watches')

store 1     NaN
store 2    10.0
store 3    35.0
Name: new watches, dtype: float64

In [75]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN      0    NaN       35

In [76]:
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 3     20      4.0     30     NaN      0    NaN       35

In [77]:
store_items = store_items.rename(columns = {'bikes': 'hats'})
store_items

         hats  glasses  pants  shirts  shoes  suits  watches
store 3    20      4.0     30     NaN      0    NaN       35

In [78]:
store_items = store_items.rename(index = {'store 3': 'last store'})
store_items

            hats  glasses  pants  shirts  shoes  suits  watches
last store    20      4.0     30     NaN      0    NaN       35

In [79]:
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  shoes  suits  watches
pants
30       20      4.0     NaN      0    NaN       35

# 10. Dealing with NaN

In [80]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

In [81]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [82]:
x = store_items.isnull()
print(x)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [83]:
x = store_items.isnull().sum().sum()
print(x)

3

In [84]:
store_items.count()

bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [85]:
store_items.dropna(axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [86]:
store_items.dropna(axis=1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

In [87]:
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

In [88]:
store_items.fillna(method='ffill', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [89]:
store_items.fillna(method='backfill', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [90]:
store_items.interpolate(method='linear', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [91]:
store_items.interpolate(method='linear', axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

# 11. Quiz: Manipulate a DataFrame

In [92]:
import pandas as pd
import numpy as np

# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {'Book Title' : books,
       'Author' : authors,
       'User 1' : user_1,
       'User 2' : user_2,
       'User 3' : user_3,
       'User 4' : user_4}


# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(dat)

# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',
# 'User 4' and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. HINT: you can use the fillna()
# function with the keyword inplace = True, to do this. Write your code below:

book_ratings.fillna(book_ratings.mean(), inplace = True)

# 12.  Loading Data into a Pandas DataFrame

In [94]:
google_stock = pd.read_csv('./GOOG.csv')

In [95]:
print(type(google_stock))
print(google_stock.shape)

<class 'pandas.core.frame.DataFrame'>
(3313, 7)

In [96]:
google_stock

            Date   Open   High    Low  Close  Adj Close    Volume
0     2004-08-19   49.7   51.7   47.7   49.8       49.8  44994500
1     2004-08-20   50.2   54.2   49.9   53.8       53.8  23005800
2     2004-08-23   55.0   56.4   54.2   54.3       54.3  18393200
3     2004-08-24   55.3   55.4   51.5   52.1       52.1  15361800
4     2004-08-25   52.1   53.7   51.6   52.7       52.7   9257400
5     2004-08-26   52.1   53.6   52.0   53.6       53.6   7148200
6     2004-08-27   53.7   54.0   52.5   52.7       52.7   6258300
7     2004-08-30   52.3   52.4   50.7   50.7       50.7   5235700
8     2004-08-31   50.8   51.5   50.7   50.9       50.9   4954800
9     2004-09-01   51.0   51.2   49.5   49.8       49.8   9206800
10    2004-09-02   49.3   50.9   49.2   50.4       50.4  15232100
11    2004-09-03   50.1   50.5   49.3   49.7       49.7   5191000
12    2004-09-07   50.2   50.7   49.5   50.5       50.5   5891300
13    2004-09-08   50.0   51.2   49.9   50.8       50.8   5023000
14    2004-09-09   50.9   51.0   50.2   50.8       50.8   4092100
15    2004-09-10   50.5   52.9   50.3   52.3       52.3   8764200
16    2004-09-13   53.0   53.9   52.9   53.4       53.4   7902900
17    2004-09-14   53.4   55.6   53.0   55.4       55.4  10910200
18    2004-09-15   54.9   56.7   54.7   55.6       55.6  10793500
19    2004-09-16   55.8   57.5   55.5   56.6       56.6   9335800
20    2004-09-17   56.8   58.4   56.4   58.4       58.4   9543500
21    2004-09-20   58.1   60.4   58.0   59.3       59.3  10708500
22    2004-09-21   59.5   59.8   58.4   58.5       58.5   7282900
23    2004-09-22   58.3   59.4   58.0   58.8       58.8   7638000
24    2004-09-23   59.0   60.9   58.1   60.0       60.0   8599600
25    2004-09-24   60.1   61.6   59.5   59.5       59.5   9191900
26    2004-09-27   59.4   60.0   58.5   58.7       58.7   7119100
27    2004-09-28   60.3   63.3   59.7   63.0       63.0  17056100
28    2004-09-29   62.9   67.1   62.7   65.1       65.1  30745600
29    2004-09-30   64.5   65.7   64.1   64.4       64.4  13861300
...          ...    ...    ...    ...    ...        ...       ...
3283  2017-09-01  941.1  942.5  935.2  937.3      937.3    947400
3284  2017-09-05  933.1  937.0  922.0  928.5      928.5   1326400
3285  2017-09-06  930.2  930.9  919.3  927.8      927.8   1527700
3286  2017-09-07  931.7  936.4  923.6  936.0      936.0   1212700
3287  2017-09-08  936.5  937.0  924.9  926.5      926.5   1011500
3288  2017-09-11  934.2  938.4  926.9  929.1      929.1   1267000
3289  2017-09-12  932.6  933.5  923.9  932.1      932.1   1134400
3290  2017-09-13  930.7  937.2  929.9  935.1      935.1   1102600
3291  2017-09-14  931.2  932.8  924.0  925.1      925.1   1397600
3292  2017-09-15  924.7  926.5  916.4  920.3      920.3   2505400
3293  2017-09-18  920.0  922.1  910.6  915.0      915.0   1306900
3294  2017-09-19  917.4  922.4  912.5  921.8      921.8    936700
3295  2017-09-20  923.0  933.9  922.0  931.6      931.6   1669800
3296  2017-09-21  933.0  936.5  923.8  932.5      932.5   1290600
3297  2017-09-22  927.8  934.7  926.5  928.5      928.5   1052700
3298  2017-09-25  925.5  926.4  909.7  921.0      921.0   1856800
3299  2017-09-26  923.7  930.8  921.1  924.9      924.9   1666900
3300  2017-09-27  927.7  949.9  927.7  944.5      944.5   2239400
3301  2017-09-28  941.4  950.7  940.5  949.5      949.5   1020300
3302  2017-09-29  952.0  959.8  951.5  959.1      959.1   1581000
3303  2017-10-02  960.0  962.5  947.8  953.3      953.3   1283400
3304  2017-10-03  954.0  958.0  949.1  957.8      957.8    888300
3305  2017-10-04  957.0  960.4  950.7  951.7      951.7    952400
3306  2017-10-05  955.5  970.9  955.2  970.0      970.0   1213800
3307  2017-10-06  966.7  979.5  963.4  978.9      978.9   1173900
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0    891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6    968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2   1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8   1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7   1157700

[3313 rows x 7 columns]

In [97]:
google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400

In [98]:
google_stock.tail()

            Date   Open   High    Low  Close  Adj Close   Volume
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0   891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6   968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2  1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8  1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7  1157700

In [99]:
google_stock.head(8)

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400
5  2004-08-26  52.1  53.6  52.0   53.6       53.6   7148200
6  2004-08-27  53.7  54.0  52.5   52.7       52.7   6258300
7  2004-08-30  52.3  52.4  50.7   50.7       50.7   5235700

In [100]:
google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [101]:
google_stock.describe()

         Open    High     Low   Close  Adj Close   Volume
count  3313.0  3313.0  3313.0  3313.0     3313.0  3.3e+03
mean    380.2   383.5   376.5   380.1      380.1  8.0e+06
std     223.8   225.0   222.5   223.9      223.9  8.4e+06
min      49.3    50.5    47.7    49.7       49.7  7.9e+03
25%     226.6   228.4   224.0   226.4      226.4  2.6e+06
50%     293.3   295.4   289.9   293.0      293.0  5.3e+06
75%     536.7   540.0   532.4   536.7      536.7  1.1e+07
max     992.0   997.2   989.0   989.7      989.7  8.3e+07

In [102]:
google_stock['Adj Close'].describe()

count    3313.0
mean      380.1
std       223.9
min        49.7
25%       226.4
50%       293.0
75%       536.7
max       989.7
Name: Adj Close, dtype: float64

In [106]:
print('Maximum values of each column:\n', google_stock.max())

Maximum values of each column:
 Date         2017-10-13
Open              1e+03
High              1e+03
Low               1e+03
Close             1e+03
Adj Close         1e+03
Volume         82768100
dtype: object

In [107]:
print('\nMinimum Close value:', google_stock['Close'].min())

Minimum Close value: 49.681866

In [108]:
print('\nAverage value of each column:\n', google_stock.mean())

Average value of each column:
 Open         3.8e+02
High         3.8e+02
Low          3.8e+02
Close        3.8e+02
Adj Close    3.8e+02
Volume       8.0e+06
dtype: float64

In [109]:
google_stock.corr()

           Open  High  Low  Close  Adj Close  Volume
Open        1.0   1.0  1.0    1.0        1.0    -0.6
High        1.0   1.0  1.0    1.0        1.0    -0.6
Low         1.0   1.0  1.0    1.0        1.0    -0.6
Close       1.0   1.0  1.0    1.0        1.0    -0.6
Adj Close   1.0   1.0  1.0    1.0        1.0    -0.6
Volume     -0.6  -0.6 -0.6   -0.6       -0.6     1.0